dwgan/STKNX_ChargeStation/source/drivers/uart/STM32F10XX/source/Stm32F10xx_uart.c
    /* Get uart number and register address */
    ucDevNo = ptPara->ucPara[UART_DEV_NO];

    /* Check if the uart number is valid or NOT */
    if(ucDevNo > (MAX_UART_DEVICE_NUM - 1))
    {
        return SW_ERR;
    }
    
    ptUartNo = sg_aptUartAddr[ucDevNo];

    /* Check command */
    switch (ptPara->ucPara[UART_OPERATION_CMD])                                
    {
        case SW_COMM_TXINT_DISEN :                        /* Command to disable Tx interrupt */
        {
            UARTX_CR1(ptUartNo) &= ~(USART_CR1_TXEIE);    /* Disable Tx interrupt            */
            break;
        }

        case SW_COMM_RXINT_DISEN :                        /* Command to disable Rx interrupt */
        {
            UARTX_CR1(ptUartNo) &= ~(USART_CR1_RXNEIE);   /* Disable Rx interrupt            */
            break;
        }

        case SW_COMM_TXINT_EN :                           /* Command to enable Tx interrupt  */              
        {
            UARTX_CR1(ptUartNo) |= USART_CR1_TXEIE;       /* Enable Tx interrupt             */                          
            break;
        }

        case SW_COMM_RXINT_EN :                           /* Command to enable Rx interrupt  */               
        {
            UARTX_CR1(ptUartNo) |= USART_CR1_RXNEIE;      /* Enable Rx interrupt             */                            
            break;
        }
        
        case SW_COMM_RX_DISEN :                           /* Command to disable Rx function  */
        {
            UARTX_CR1(ptUartNo) &= ~(USART_CR1_RE);       /* Disable Rx function             */
            break;
        }
        
        case SW_COMM_TX_DISEN :                           /* Command to disable Tx function  */
        {
            UARTX_CR1(ptUartNo) &= ~(USART_CR1_TE);       /* Disable Tx function             */
            break;
        }

        case SW_COMM_RX_EN:
        {
            UARTX_CR1(ptUartNo) |= USART_CR1_RE;
            break;
        }

        case SW_COMM_TX_EN:
        {
            UARTX_CR1(ptUartNo) |= USART_CR1_TE;
            break;
        }

        case SW_COMM_DEV_CONFIG :                         /* Command to configure uart       */
        {
            float fTemp;
            /* Disable TX/RX first before UART init */
            UARTX_CR1(ptUartNo)  &= ~(USART_CR1_TE | USART_CR1_RE);
 
            /* Configure the bit mode */
            switch (ptPara->ucPara[UART_BIT_MODE])        /* Check the bit mode              */
            {
                case SW_UART_CHAR_NUM_8:                  /* If it is 8 bit mode             */
                {
                    UARTX_CR1(ptUartNo) &= ~(USART_CR1_M);/* Set 8-bit mode                  */
                    break;
                }
                
                case SW_UART_CHAR_NUM_9:                  /* If it is 9 bit mode             */
                {
                    UARTX_CR1(ptUartNo) |= USART_CR1_M;   /* Set 9-bit mode                  */
                    break;
                }
                                
                default:                                  /* Invalid parameter               */
                {
                    return SW_ERR;
                }
            }

            /* Configure the STOP BIT */
            UARTX_CR2(ptUartNo) &= ~(USART_CR2_STOP);     /* Clear Stop bits first           */
            switch (ptPara->ucPara[UART_STOP_BIT_MODE])   /* Check stop bit mode             */
            {
                case SW_UART_STOP_BIT_ONE:                /* If it is 1-bit stop mode        */
                {
                    break;                                /* Already done                    */
                }
                case SW_UART_STOP_BIT_TWO:                /* If it is 2-bit stop mode        */
                {
                    UARTX_CR2(ptUartNo) |= USART_CR2_STOP_TWO_BIT; /* Set 2-bit stop mode    */
                    break;
                }
                default:                                  /* Invalide parameter              */
                {
                    return SW_ERR;
                }
            }

            /* Configure the parity mode */
            switch (ptPara->ucPara[UART_PARITY_MODE])     /* Check parity mode               */
            {
                case SW_UART_PARITY_NO:                   /* If no parity                    */
                {
                    UARTX_CR1(ptUartNo) &= ~(USART_CR1_PCE);/* Disable parity                */
                    break;
                }
                case SW_UART_PARITY_ODD:                  /* If odd parity                   */
                {
                    UARTX_CR1(ptUartNo) |= USART_CR1_PCE; /* Enable parity                   */
                    UARTX_CR1(ptUartNo) |= USART_CR1_PS;  /* Select odd parity               */
                    break;
                }
                case SW_UART_PARITY_EVEN:                 /* If even parity                  */
                {
                    UARTX_CR1(ptUartNo) |= USART_CR1_PCE; /* Enable parity                   */
                    UARTX_CR1(ptUartNo) &= ~(USART_CR1_PS);/* Select even parity             */
                    break;
                }
                default:                                  /* Invalid parameter               */
                {
                    return SW_ERR;
                }
            }
            
            /* Configure the Baud rate */
            /* Get baud rate */
            if(ptPara->ucPara[UART_BAUD_MODE] > SW_UART_BAUD_115200)
            {
                return SW_ERR;
            }
            dwBaudRate = sg_awBaudRate[ptPara->ucPara[UART_BAUD_MODE]];
           
            /* Get PCLK */
            if(UART_1 == ucDevNo) /* If it is uart1 which uses APB2 */
            {
                dwPCLK = SystemFrequency_APB2Clk;
            }
            else/* Else use APB1 */
            {
                dwPCLK = SystemFrequency_APB1Clk;
            }

            /* Calculate BRR value -- BRR = (PCLK/(BAUDRATE*16))*/

            /* Calculate BRR value -- BRR = (PCLK/(BAUDRATE*16))*/
            fTemp  = (float)(dwPCLK/100)/(dwBaudRate << 4);
            dwMantissa = (WORD32)fTemp;
            dwFraction = (WORD32)((fTemp - dwMantissa) * 16);
            dwMantissa <<= 4;
            dwMantissa += dwFraction;
            UARTX_BRR(ptUartNo) = dwMantissa;  /* Ser UART_BRR value */

            break;
        }

