dwgan/STKNX_ChargeStation/source/drivers/uart/STM32F10XX/source/Stm32F10xx_uart.c
        case SW_COMM_GET_RX_STAT :                        /* Command to get Rx status        */
        {
            /* If Rx function is enabled AND get a received data */
            if ((UARTX_SR(ptUartNo)  & USART_SR_RXNE)\
              &&(UARTX_CR1(ptUartNo) & USART_CR1_RE))         
            {
                ptPara->ucPara[UART_COMM_STAT] = SW_COMM_READY;     /* Output ready          */
            }
            else
            {
                ptPara->ucPara[UART_COMM_STAT] = SW_COMM_NOT_READY; /* Output NOT ready      */
            }
            break;
        }

        case SW_COMM_GET_TX_STAT :                        /* Command to get Rx status        */
        {
            /* If Rx function is enabled AND get a received data */
            if ((UARTX_SR(ptUartNo)  & USART_SR_TXE)\
              &&(UARTX_CR1(ptUartNo) & USART_CR1_TE))         
            {
                ptPara->ucPara[UART_COMM_STAT] = SW_COMM_READY;     /* Output ready          */
            }
            else
            {
                ptPara->ucPara[UART_COMM_STAT] = SW_COMM_NOT_READY; /* Output NOT ready      */
            }
            break;
        }
        
        default :                                         /* Invalid command                 */
        {
            return SW_ERR;
        }
    }
    return SW_OK;
}


/**************************************************************************
* Funciton: WORD32 Uartx_Read(T_DATA_OPERARTION *ptData)
* Descrip.: Get data from Rx buffer 
* Input   : T_DATA_OPERARTION *ptData->ucDevNo      1~5    Number of Uart
* Output  : T_DATA_OPERARTION *ptData->wDataLength  1      Length of Rx data
*           T_DATA_OPERARTION *ptData->pucBuffer           Rx data
* Return  : SW_OK    Successful
            SW_ERR   Failed
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/25       V1.0         Ian          Create 
**************************************************************************/
WORD32 Uartx_Read(T_DATA_OPERARTION *ptData)
{
    BYTE            ucDevNo = ptData->ucDevNo;
    T_UART_MEM_MAP  ptUartNo;
    volatile WORD16 wData;

    /* Check if input parameters are valid or NOT */
    if((ucDevNo > (MAX_UART_DEVICE_NUM - 1)) || (NULL == ptData))                                                    
    {
        return SW_ERR;
    }    

    /* Get uart register address */
    ptUartNo = sg_aptUartAddr[ucDevNo];

    /* Return error if:           */
    /* Rx function is NOT enabled */
    /* Or error happens           */
    /* Or no data in Rx buffer    */
    if((!(UARTX_CR1(ptUartNo) & USART_CR1_RE))\
     ||  (UARTX_SR(ptUartNo)  & USART_SR_ERR_MASK)\
     ||(!(UARTX_SR(ptUartNo)  & USART_SR_RXNE)))
    {
        wData = UARTX_SR(ptUartNo);   /* Clear error status */    
        wData = UARTX_DR(ptUartNo);   /* Clear Rx buffer    */
        return SW_ERR;
    }
    /* Else, it is a valid data and return the data back    */
    
    ptData->wDataLength = 1;
    *ptData->pucBuffer  = UARTX_DR(ptUartNo);          
    return SW_OK;                                                   
}


/**************************************************************************
* Funciton: WORD32 Uartx_Write(T_DATA_OPERARTION *ptData)
* Descrip.: Send data of tx buffer. 
* Input   : T_DATA_OPERARTION *ptData->ucDevNo      1~5    Number of Uart
* Output  : T_DATA_OPERARTION *ptData->wDataLength  1      Length of Rx data
*           T_DATA_OPERARTION *ptData->pucBuffer           Rx data
* Return  : SW_OK    Successful
            SW_ERR   Failed
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/25       V1.0         Ian          Create 
**************************************************************************/
WORD32 Uartx_Write(T_DATA_OPERARTION *ptData)
{
    BYTE ucDevNo = ptData->ucDevNo;
    T_UART_MEM_MAP ptUartNo;

    /* Check if input parameters are valid or NOT */
    if((ucDevNo > (MAX_UART_DEVICE_NUM - 1)) || (NULL == ptData) || (1 != ptData->wDataLength))                                                    
    {
        return SW_ERR;
    }    
    
    /* Get uart register address */
    ptUartNo = sg_aptUartAddr[ucDevNo];

    /* Return error if:           */
    /* Tx function is NOT enabled */
    /* Or data stay in Tx buffer  */
    if((!(UARTX_CR1(ptUartNo) & USART_CR1_TE)) || (!(UARTX_SR(ptUartNo) & USART_SR_TXE)))
    {
        return SW_ERR;
    }
    /* Else, it is a valid data and send data into Tx buffer */
    UARTX_DR(ptUartNo) = *(ptData->pucBuffer);                                            

    return SW_OK;
}




/**************************************************************************
* Funciton: void Uart_Reg(BYTE ucLogNo, BYTE ucDevNo, VOID *ptPara)
* Descrip.: Register Uart
* Input   : BYTE ucLogNo      Device logic No.
*           BYTE ucDevNo      Device physical No.
*           VOID *ptPara      None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/31       V1.0         Ian          Create 
**************************************************************************/
void Uart_Reg(BYTE ucLogNo, BYTE ucDevNo, VOID *ptPara)
{
    T_REGISTED_DEVICE tUartDev;

    /* Check if the device No. is valid or NOT */
    if(ucDevNo > (MAX_UART_DEVICE_NUM - 1))
    {
        return;
    }

    /* set operation. */
    sg_tUartOp.pfDrvInit  = Uartx_Init;
    sg_tUartOp.pfDrvCtrl  = Uartx_Ctrl;
    sg_tUartOp.pfDrvRead  = Uartx_Read;
    sg_tUartOp.pfDrvWrite = Uartx_Write;
    /* register this device. */    
    tUartDev.ucAppType  = SW_COMM_INTERFACE;
    tUartDev.ucDevId    = SW_PERIPHERAL_UART;
    tUartDev.ucLogDevNo = ucLogNo;
    tUartDev.ucDevNo    = ucDevNo;
    tUartDev.ptDevOp    = &sg_tUartOp;
    tUartDev.pfCallBack = NULL;
    /* call register interface. */
    API_ComDrv_Reg(&tUartDev);
    
    return;
}

/**************************************************************************
* Funciton: static void Uartx_isr(BYTE ucNo)
* Descrip.: interrupt process function of uartx
* Input   : BYTE ucNo      1-5     Number of uart
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
static void Uartx_isr(BYTE ucDevNo)
{
    volatile WORD32 dwData;
    T_SW_INT_EVENT tReason;
    T_UART_MEM_MAP ptUartNo = sg_aptUartAddr[ucDevNo];
   
    /* Fill information of reason */
    tReason.ucAppType   = SW_COMM_INTERFACE;                      
    tReason.ucDevId     = SW_PERIPHERAL_UART;
    tReason.ucDevNo     = ucDevNo;
    tReason.ucBuffer[UART_INT_DATA_LEN_POS] = 0;

    /* If it is an interrupt due to error flags */
    if(UARTX_SR(ptUartNo) & USART_SR_ERR_MASK)
    {
        /* Clear error flag and data, and provide error event */
        dwData = UARTX_SR(ptUartNo);     
        dwData = UARTX_DR(ptUartNo);  
        tReason.ucEvent = INTERRUPT_EVENT_ERR;
    }

    /* If it is Rx interrupt */
    else if(UARTX_SR(ptUartNo) & USART_SR_RXNE)
    {
        /* receive Data */
        tReason.ucBuffer[UART_INT_RX_DATA_POS]  = UARTX_DR(ptUartNo);
        tReason.ucBuffer[UART_INT_DATA_LEN_POS] = 1;
        tReason.ucEvent = INTERRUPT_EVENT_RX;
    }

